[
	{
		"Supplier Contracting Process": {
			"details": {
				"overall": "This procedure describes the governance framework, responsibility and approval authority matrix, and activities involved in identifying a business need and selecting suppliers up to the point of awarding a Subcontract (as defined below). The governance framework and responsibility matrix ensure appropriate business engagement, oversight and management of program procurement-related decisions."
			},
			"section number": 1
		},
		"definitions": {
			"details": {
				"Best Value": "The optimal balance of technical capability, acquisition cost, life-cycle cost, demonstrated reliability and supportability, and quality while fulfilling Industrial and Regional Benefits (IRB) contractual obligations to the client and sustainable, environmental and ethical considerations. It also includes consideration for optimizing common equipment, systems architecture, and systems arrangements across programs. The specific criteria and the associated weighting for achieving Best Value are tailored for each procurement event.",
				"Bidder": "A supplier that participates in the RFx process with the opportunity to submit a Proposal.",
				"Blackout Period": "The period from the date the competitive procurement documents are issued until the closing time. During the blackout period in all competition situations, it is imperative that all communication with suppliers involved in the process occur formally, through the subcontract authority (SA).",
				"Competitive Sourcing": "Supply Chain Management (SCM) uses a competitive solicitation process that aims to enhance access, competition and fairness and assures that a reasonable and representative number of Bidders are given an opportunity to bid.",
				"Control Account": "Management point that incorporates approved scope(s) of work, budget, period of performance and project cost estimate at completion.",
				"Evaluators": "Individuals identified to evaluate proposals submitted against a particular RFx. For details, see Subcontract RFx Process.",
				"Flow-Down Terms and Conditions": "Program-specific Key Terms that The Company must flow down to Subcontracts in order to meet the obligations of a Prime Contract (for details, see Program Subcontract Negotiation Playbook).",
				"Goods": "Systems, equipment or components to be provided by a supplier to THE COMPANY under a Subcontract, that will be incorporated into a new construction project.",
				"Integrated Master Schedule (IMS)": "A network of tasks linked from project start through project finish, reflecting the interdependencies between tasks and milestones. The IMS is the foundation of the performance measurement baseline used to track progress, forecasts and changes throughout a project.",
				"Key Terms": "Terms from the prime-aligned subcontract packs that must use the Subcontract Negotiation Playbook Governance process in the event that suppliers request deviations as part of the subcontract negotiations.",
				"Prime Contract": "The contract between THE COMPANY and its client.",
				"Prime Contract Program Execution": "Contracting structure for vessel design and construction divided into stages such as Ancillary, Long Lead Item (LLI), Construction Engineering and Build.",
				"Procurement Register": "Listing of scoped services and Goods that will be managed for procurement. The departments’ responsibilities through the life cycle of each Scope of Work are captured in this document.",
				"Procurement Solution": "Categories of requirements and scopes sourced and managed by SCM.",
				"Procurement Summary": "A summary of the bid process that is prepared by SCM and issued to the client by Contracts & Commercial.",
				"Recommendation to Proceed (RTP)": "Endorsement of a Competitive Sourcing process that summarizes the Proposals received, provides measurable evaluations of each and recommends a Bidder for award.",
				"Request for Information (RFI)": "Used when detailed information and feedback are required from Bidders. Such requests might outline a potential requirement and request that Bidders describe their ability to satisfy the requirement and provide suggestions on how the eventual solicitation might be structured.",
				"Request for Proposal (RFP)": "Used when, owing to the nature of the requirement, Bidders are invited to propose a solution to a problem, requirement or objective, and the selection of the supplier is based on the effectiveness of the proposed solution.",
				"Request for Quotation (RFQ)": "Used to solicit bids for lower complexity goods and/or services. The contract requirement must be well defined such that bids may be evaluated and compared based on price and delivery.",
				"Scope of Work (SOW)": "The division of work to be performed under a Subcontract in the completion of a project, typically broken out into specific tasks with deadlines. It captures and defines the work activities, deliverables and timeline a supplier must execute.",
				"Single Source": "A specific supplier chosen outside the Competitive Sourcing process, based on a justification that, even though there are different Bidders that produce and sell similar merchandise, THE COMPANY completed a thorough analysis of the single Bidder and they were chosen based on price, quality of products or performance characteristics. The client may also direct this choice.",
				"Sole Source": "Indicates that one and only one source exists and/or only one Bidder can fulfil all the requirements of a unique product or service having singular characteristics or performance capabilities.",
				"Subcontract": "Any subcontract or agreement, including all appendices, annexes and supplements (or similar), that SCM manages on behalf of the COMPANY, but specifically excludes contracts between THE COMPANY and its clients.",
				"Technical Purchase Specification (TPS)": "A Technical Purchase Specification describes the work required under a Subcontract for the design, manufacture, supply, delivery and/or integration of technical equipment and services, and is used to support a specific scope of work."
			},
			"section number": 3
		},
		"process overview": {
			"details": {
				"Phase 1 Scope of Work Development": "This initial phase defines a project-specific business need or set of needs. The Scope of Work (SOW) specifies the requirements needed to address the identified business objective(s). The main milestones are:Identify project-specific business needs.Complete the Procurement Register, as required.Define the SOW Owner and Stakeholders, using the SOW Responsibility Matrix as a guideline (see SOW Responsibility Matrix).Create, review and approve the Scope of Work (SOW).",
				"Phase 2 Sourcing": "This phase defines the plan for the RFP/RFQ, identifies and registers potential Bidders, and evaluates and ranks their proposals. Key deliverables are the Bidders List, RFP/RFQ Documents and the Resulting Subcontract. The main milestones are:Establish the Bidders List.Run the RFP/RFQ.Prepare the Resulting Subcontract and RFP/RFQ Documents.Issue the RFP/RFQ to Market.Receive and evaluate the proposals.Negotiate the terms and conditions, technical and financial aspects of the agreement with down-selected Bidders.",
				"Phase 3 Subcontract Award": "Finalizes the Subcontract between the successful Bidder and the Company with final approval from the Financial Authority and, if required, the client. The main milestones are:Issue the Recommendation to Proceed (RTP), Procurement Summary and Deviation Schedule (if applicable).Award the Subcontract.Note: Depending on the project, the client may be involved in key deliverable reviews. For the full workflow map see Appendix D Supplier Contracting Process Map.",
				"overall": "Supply Chain Management (SCM) leads the Supplier Contracting process through the initial identification of a business need to the award of a Subcontract. Note that the new construction programs will establish a program subcontracting governance structure (see Section 6), at program outset."
			},
			"section number": 5
		},
		"program subcontracting governance model": {
			"details": {
				"overall": "Governance specific to subcontracting activities is established in the context of the Program Procurement Terms of Reference (TOR) and other governance elements (as defined in the Supply Chain Management Plan (SCMP)) and engages two groups to enable decision-making: the Procurement Register Review Panel and the Program Steering Committee."
			},
			"section number": 6
		},
		"program subcontracting governance model - decision making": {
			"details": {
				"overall": "Decision making rights are in accordance with the Approval Authority Matrix. Should agreement not be reached, the decision must be escalated to the next level of governance."
			},
			"section number": 6.1
		},
		"program subcontracting governance model - roles": {
			"details": {
				"overall": "General roles, such as Chair, Core Members, etc., are defined in the SCM Plan. The governance bodies, Procurement Register Review Panel and Program Steering Committee, are configured according to Table 1: Program Subcontracting Governance Bodies."
			},
			"section number": 6.2
		},
		"roles and responsibilitites": {
			"details": {
				"Contracts & Commercial": "Involved, as defined in the Approval Authority Matrix, in reviewing deliverables such as the Procurement Summary and, as needed, Scopes of Work (SOWs).",
				"Control Account Manager (CAM)": "Accountable for ensuring that the defined Scope of Work for a Control Account is achieved to the budget, schedule and quality standards in accordance with project requirements. Responsible for approving the scopes and strategies relevant to their Control Accounts as listed in the Procurement Register.",
				"Optional Stakeholders": "Support SOW development by representing as appropriate any relevant function related to a SOW. The SOW Owner or SCM will consult with them during SOW development. See also Appendix C: SOW Responsibility Matrix.",
				"Package Engineer (PE), SCM": "Responsible for the Procurement Register and leading discussions related to all program-specific procurement as per Procurement Register Development and Management.",
				"Planning and Program Controls": "Will load the activities required to complete the Subcontracting process into the IMS.",
				"Primary Stakeholders": "Support SOW development by adding supporting requirements to a SOW as applicable based on the core requirements defined by the SOW Owner. See also Appendix C: SOW Responsibility Matrix.",
				"Project Management Office (PMO)": "Involved, as defined in the Approval Authority Matrix, at each phase of Supplier Contracting in reviewing deliverables such as the Procurement Register, Recommendation to Proceed (RTP) and, as needed, Scopes of Work (SOWs), TPS and Bidders List.",
				"SOW Owner": "Gathers and/or defines the technical requirements and other specifications for the scope and is responsible for the SOW/TPS. The SOW Owner must be a qualified representative from a department (such as Engineering).",
				"Supply Chain Management (SCM)": "The combined Procurement and Subcontracting function. The Supply Chain Controls Manager is responsible for updating this procedure and the SCM Director(s) are accountable for approving this procedure and ensuring that SCM activities conform to the policies and procedures herein. SCM is actively engaged in all phases of the Supplier Contracting process.",
				"overall": "The general responsibilities of this procedure are shown in Appendix A RACI Summary Chart. The governance model that provides the decision-making framework for this procedure is provided in Section 6."
			},
			"section number": 4
		},
		"scope": {
			"details": {
				"overall": "This procedure applies to Subcontracts undertaken in support of new construction programs. The Procurement Solutions in scope are Engineering and Design Services, Professional Services, Major Equipment and LLI, Procurement, and Turnkey. This procedure does not address Supply Only procurement solutions (e.g., project-agnostic Master Service Agreements (MSAs)), Embedded Contractors, or Procurement processes that are managed exclusively by purchase orders (such as general COTS supply items)."
			},
			"section number": 2
		},
		"sourcing phase - evaluate the proposals": {
			"details": {
				"overall": "All submissions will be evaluated against the defined evaluation criteria as defined in the Subcontracting RFx Process. Proposals developed under Sole Source conditions and greater than $100,000 CAD in value require a price certification. If the value of the Sole Source proposal is greater than $1 million CAD, a financial review is also required. For details, see Subcontract Financial Review. Rank Proposals – Evaluators provide their independently assessed evaluations to SCM, and results are consolidated by SCM (for example, via a Consensus Meeting, during which SCM reviews the assessments with relevant stakeholders). SCM arrives at a single final evaluation, which ranks the proposals. Complete Price and Cost Analysis…SCM will analyse the pricing of the proposals to determine if they are fair and reasonable, according to the Supplier Proposal Price Analysis. Single or Sole Source proposals valued over $1 Million CAD must complete a cost analysis (for details see Supplier Proposal Cost Analysis).Down-Select Bidders – SCM proceeds with down-selection and, before starting negotiations, will evaluate if the down-selected Bidders require a Supplier Financial Strength assessment.Note: If A SOW/TPS has security requirements, SCM must provide the name of the down-selected Bidder and the resulting Subcontract number to the Security Officer (CSO) to initiate the Bidders’ sponsorship to the Contract Security Program (CSP) and follow the procedure Supplier and Subcontractor CSP Compliance Security Assessments. For full details, Subcontract RFx Process."
			},
			"section number": 8.4
		},
		"sourcing phase - identify and register bidders": {
			"details": {
				"overall": "Once the SOW/TPS has been finalized, SCM will set up a pre-bid Integrated Program Team (IPT) to include all key stakeholders to discuss the bid strategy for the RFP/RFQ. SCM must complete the proposed Bidders List and bid schedule and establish the key criteria for the bid evaluation. An RFP/RFQ must be completed for both Competitive Sourcing and Sole/Single sourcing. RFIs are optional and are administered by SCM and Engineering as needed. For further dtails, see Subcontracting RFx Process. For competitively sourced Subcontracts, SCM prepares a Bidders List. If Competitive Sourcing is not performed, a Bidders List is not used because any Sole or Single Sourcing is identified and approved during the Procurement Register Review (see Procurement Register Development and Management). The Bidders List should be approved in accordance with the Approval Authority Matrix. For full details, see SCM Sourcing and Supplier Review. Note: RFQs for low complexity commodities may run a simplified sourcing process. For details see the work instruction Subcontracting RFx Process. To submit a proposal, suppliers must be registered in the Supplier Portal. Registering as a supplier is distinct from and does not equate to being a Pre-Qualified supplier. There may be situations where a supplier requires emergency pre-qualification status. For further details on the pre-qualification process, see the procedure Supplier Pre-Qualification Process. The pre-qualification process may continue at later stages but must be completed before awarding a Subcontract."
			},
			"section number": 8.1
		},
		"sourcing phase - negotiate the terms of the agreement": {
			"details": {
				"overall": "SCM will enter competitive negotiation with suppliers to find Best Value. To negotiate payment controls, including holdbacks, see Implementation of Payment Controls. Note: Before entering negotiations under Single or Sole Source conditions, SCM must establish negotiation objectives. For details, see Negotiation Strategy and Objectives. SCM will work with the successful Bidder to resolve change requests related to the terms of the Resulting Subcontract. If the requested change is to a Key Term, SCM will follow the Program Subcontract Negotiation Playbook. SCM must obtain approvals as required per the Playbook. If the requested change is not to a Key Term, SCM will negotiate using their discretion and adhering to the principals of Best Value. All Key Term deviation requests must be captured in the Deviation Request Schedule as per the Program Subcontract Negotiation Playbook. Note: The SOW/TPS may be updated with changes that result from any negotiated technical deviations."
			},
			"section number": 8.5
		},
		"sourcing phase - prepare the resulting subcontract and rrfp or rfq documents": {
			"details": {
				"overall": "SCM is responsible to prepare the documents required to release an RFP/RFQ. These documents can be prepared in parallel with the Bidders List. The steps are as follows: 1.Create the resulting Subcontract using the approved contract pack (such as the Subcontract Pack Template). 2.Develop the RFP/RFQ Documents that define the conditions that must be met by the Bidder’s response. For full details, see the work instruction Subcontracting RFx Process. Note: To define the basis of payment, including payment controls such as holdbacks, see Implementation of Payment Controls. 3.Perform a quality check of the resulting Subcontract and RFP/RFQ Documents prior to releasing to market. 4.Collect signed Non-Disclosure Agreements (NDAs) and Participation Agreement from Bidders."
			},
			"section number": 8.2
		},
		"sourcing phase - run the rfp or rfq": {
			"details": {
				"overall": "Once the RFP/RFQ has been reviewed and the Bidders List is finalized, SCM issues an RFP/RFQ to each Bidder. This signals the beginning of the proposal Blackout Period, which means that SCM becomes the sole point of contact between the Company and the Bidder for all communication with regards to the RFP/RFQ. For full details, see Subcontracting RFx Process.When the RFP/RFQ is closed, the evaluation of the submitted proposals begins."
			},
			"section number": 8.3
		},
		"sow development phase - complete the procurement register": {
			"details": {
				"overall": "Note: MSAs are not defined by specific projects and do not need to be reviewed by the Procurement Register Panel. The PE and relevant Subject Matter Experts (SMEs) will collaborate to define the strategy of each scope relevant to their disciplines and will account for all planning activities (see the work instruction Procurement Register Development and Management). Scopes with a High Approval Authority level will be escalated to the Program Steering Committee, in accordance with the program Subcontracting Governance Model. For details on the Approval Authority Levels, see Table 3: Approval Authority Levels. Once the proposed strategy of the scope is reviewed by the Review Panel or Steering Committee and approved in accordance with the Approval Authority Matrix, the SOW development process can be initiated. Program Controls will load the standard subcontracting activities to the IMS (note that only packages with specific milestones, such as LLI packages, are tracked in the IMS). For all items included in the Procurement Register, the SOW Owner and Stakeholders must also be identified (using the SOW Responsibility Matrix as a guideline) to fulfil the responsibilities indicated in the remainder of this procedure. Note: If a SOW/TPS has security requirements (protected or classified information and assets, or regulated by the Controlled Goods Program (CGP)), SCM must engage with Security as described in Procurement Register Development and Management."
			},
			"section number": 7.2
		},
		"sow development phase - develop the scope of work": {
			"details": {
				"overall": "Scopes of Work (SOW) or Technical Purchase Specifications (TPS) must be developed for inclusion in the RFP/RFQ. Generally, a SOW will be developed for contracting services and a TPS when sourcing Goods. The SOW Owner may lack sufficient information to finalize a SOW/TPS and may, during the Procurement Register Review, request that SCM assist in obtaining the relevant information by issuing a Request for Information (RFI) to a selected group of suppliers. All communication must be coordinated through the appointed SCM resource. Further detail is provided in Subcontracting RFX Process. SCM will initiate the SOW/TPS and engage all relevant SOW Owners and Stakeholders (as specified in  SOW Responsibility Matrix). For full details, see the work instruction SOW/TPS Development Process. All technical documents written by the SOW Owner should have an appropriate and relevant level of sign off per the procedure Delegation of Technical Authority. Note: A TPS may be developed by a designated third party. For details, see Third Party TPS Development. SCM will complete the elements listed in the SOW/TPS Template based on the information collected and will distribute it to the Stakeholders for review and approval in accordance with the Approval Authority Matrix. Depending on the project and the scope, the client may need to approve the SOW/TPS. If the client provides comments requiring revisions, the SOW/TPS will have to complete additional reviews as needed."
			},
			"section number": 7.3
		},
		"sow development phase - identify a business need": {
			"details": {
				"overall": "During the different stages of Prime Contract Program Execution, the SOW Owner will identify the need to source project-related Goods or services. Some sources where business needs can be identified are, but are not limited to: Prime Contract proposal requirements, Construction Specifications stated in the Prime Contract, Basic, Functional and Construction design. Note: Requirements that are managed exclusively via a purchase order or via an MSA fall outside the scope of this procedure. The Package Engineer adds the Goods or services identified to the project’s Procurement Register, which is reviewed regularly by the Procurement Register Review Panel and Program Steering Committee in accordance with the program Subcontracting Governance Model (see Section 6)."
			},
			"section number": 7.1
		},
		"subcontract award phase - approval of procurement summary": {
			"details": {
				"overall": "SCM provides a Procurement Summary to Contracts & Commercial for review. Contracts & Commercial issues the final Procurement Summary to the client for external review and approval."
			},
			"section number": 9.2
		},
		"subcontract award phase - approval to award the subcontract": {
			"details": {
				"overall": "Once the RTP and Procurement Summary are approved, SCM submits a Commitment Review Authorization Form (CRAF), together with the Deviation Schedule (if required) and any relevant Task Authorizations. SCM finalizes the Subcontract, with final approval from the Financial Authority in accordance with the Commitment Authorization Process (CAP). Further details of the award process are available in Subcontracting RFX Process."
			},
			"section number": 9.3
		},
		"subcontract award phase - recommendation to award the subcontract": {
			"details": {
				"overall": "Once negotiations are finished, SCM prepares a Recommendation to Proceed (RTP) for internal review and approval. The RTP, and any other pertinent documents, are reviewed in accordance with the Approval Authority Matrix. Note: The Prime Contract will define any instances where the client’s consent will be required prior to awarding a Subcontract, such as in the absence of a Competitive Sourcing process. If client approval is required, and client-specific approval forms for award of a subcontract are needed, Contracts & Commercial will provide the client with the relevant client-specific approval forms, which must be completed by SCM. Note: The Company is required to send a Defence Priorities and Allocations System (DPAS) Program application for all NSS subcontracts, POs, MSAs, etc for U.S.-sourced goods or services. For details, see Subcontracting RFX Process."
			},
			"section number": 9.1
		},
		"supplier contracting": "purpose"
	}
]